In [1]:
# Cell 1: Import the functions from your scripts
import sys
from pathlib import Path

# Add the project root to the path
sys.path.append(str(Path.cwd().parent))

from src.data.load_data import load_raw_data
from src.data.clean_data import clean_Bank_data
from src.data.save_data import save_interim, save_processed

print("Functions imported successfully!")

Functions imported successfully!

In [9]:
###Load Cleaned Data

In [2]:
raw_df = load_raw_data("../../Banking_Marketing_Analysis/data/raw/bank.csv")
clean_df = clean_Bank_data(raw_df)
clean_df.head()

Raw data loaded: 4521 rows, 17 columns
Replaced 'unknown' with NaN
Replaced 'pdays' -1 with NaN
Converted 11 columns to 'category'
Standardized column names

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,NaN,0,NaN,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,NaN,3,jun,199,4,NaN,0,NaN,no
4,59,blue-collar,married,secondary,no,0,yes,no,NaN,5,may,226,1,NaN,0,NaN,no

In [3]:

clean_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4483 non-null   category
 2   marital    4521 non-null   category
 3   education  4334 non-null   category
 4   default    4521 non-null   category
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   category
 7   loan       4521 non-null   category
 8   contact    3197 non-null   category
 9   day        4521 non-null   int64
 10  month      4521 non-null   category
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      816 non-null    category
 14  previous   4521 non-null   int64
 15  poutcome   816 non-null    category
 16  y          4521 non-null   category
dtypes: category(11), int64(6)
memory usage: 277.2 KB

In [4]:
clean_df.describe()

,age,balance,day,duration,campaign,previous
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,1422.657819,15.915284,263.961292,2.793630,0.542579
std,10.576211,3009.638142,8.247667,259.856633,3.109807,1.693562
min,19.000000,-3313.000000,1.000000,4.000000,1.000000,0.000000
25%,33.000000,69.000000,9.000000,104.000000,1.000000,0.000000
50%,39.000000,444.000000,16.000000,185.000000,2.000000,0.000000
75%,49.000000,1480.000000,21.000000,329.000000,3.000000,0.000000
max,87.000000,71188.000000,31.000000,3025.000000,50.000000,25.000000